package chapter02;

public class Study1 {

	public static void main(String[] args) {

		//1. 변수란? 
		//하나의 값을 저장할 수 있는 메모리 공간(RAM).
		//메모리 값을 읽어올 때 메모리 주소를 읽어와야하지만
		//사람이 기억하기 힘들기 때문에 특정 메모리 영역에 이름을 붙이고
		//메모리 주소 대신에 메모리 값을 저장하고 읽을 수 있게 하는 것.
		//단 하나의 값만 저장할 수 있음.
		//변수에 새로운 값을 저장하면 기존에 저장된 값은 지워지고 새로 저장한 값만 남게 됨

		//2. 변수의 선언
		//값(data)을 저장할 공간을 마련
		//변수타입 변수이름; ex) int age;

		//3. 변수에 값 저장
		//'=' 대입연산자
		//변수 초기화 변수에 처음으로 값을 저장하는 것
		int age = 25;
		int x = 1;
		int y = 2;
		//== int x = 1, y = 2; 

		//※변수의 종류에는 클래스 변수, 인스턴스 변수, 지역 변수가 있음
		//지역 변수는 읽기 전에 반드시 초기화해줘야함

		//4. 변수 읽어오기
		//변수의 값이 필요한 곳에 변수의 이름을 적음



	}

}
