package chapter06;

public class Study02 {

	public static void main(String[] args) {
		
		//클래스와 객체
		//클래스는 객체를 정의해놓은 것이며, 용도는 객체를 생성하는 데 사용
		//객체는 실제로 존재하는 것이며, 용도는 객체가 가지고 있는 기능과 속성에 따라 다름
		//즉, 클래스는 설계도, 객체는 제품이라고 생각하면 편함 
		//제품 설계도(클래스) - 제품(객체), TV 설계도(클래스) - TV(제품)

		//객체의 구성요소 - 속성과 기능
		//객체 = 속성(변수) + 기능(메서드)
		
		//객체와 인스턴스
		//객체 : 모든 인스턴스를 대표하는 일반적인 용어
		// == 인스턴스 : 특정 클래스로부터 생성된 객체(ex, tv인스턴스)
		// 클래스(설계도) --인스턴스화--> 인스턴스(객체)(제품)
		
		//클래스(설계도)가 필요한 이유? 객체(제품)를 생성하기 위해
		//객체(제품)가 왜 필요한 이유? 객체를(제품을) 사용하기 위해
		//객체를 사용한다는 것은? 객체가 가진 속성(변수)과 기능(메서드)을 사용하기 위해
		

	}

}
