package chapter06;

public class Study04 {

	public static void main(String[] args) {

		//객체의 생성과 사용
		//클래스 작성(설계도) -> 객체 생성(제품 생성) -> 객체의 사용(제품 사용) 순서 
		
		//객체의 생성
		//클래스명 변수명; 클래스의 객체를 참조하기 위한 참조변수를 선언
		//변수명 = new 클래스명(); 클래스의 객체를 생성한 후, 객체의 주소를 참조변수에 저장
		//==> 클래스명 변수명 = new 클래스명();
		// Tv t; Tv클래스 타입의 참조변수 t를 선언
		// t = new Tv(); Tv인스턴스를 생성한 후, 생성된 Tv 인스턴스의 주소를 t에 저장
		
		//객체의 사용
		//객체의 변수, 메서드를 사용
		
		//t.channel = 10; Tv인스턴스의 멤버변수 channel의 값을 10로 함. (변수 사용)
		//t.channelDown(); Tv인스턴스의 메서드 channelDown()을 호출. (메서드 사용(호출))
		
		//하나의 인스턴스를 여러 개의 참조변수가 가리키는 경우 -> 가능
		//여러 인스턴스ㅇ를 하나의 참조변수가 가리키는 경우는 -> 불가능
		//변수 하나의 값만 저장 가능
		

	}

}
