package chapter06;

public class Study17 {

	public static void main(String[] args) {
		
		//생성자(constructor) = iv초기화 메서드
		//인스턴스가 생성될 때마다 호출되는 '인스턴스* 초기화 메서드'
		//*인스턴스 = 객체(iv묶음), 인스턴스 초기화 = iv초기화
		//인스턴스 생성 시 수행할 작업(iv 초기화)에 사용
		
		//생성자 규칙
		//1. 이름이 클래스 이름과 같아야함(생성자 이름 = 클래스 이름)
		//클래스이름(타입 변수명, 타입 변수명,...){
		// 인스턴스 생성 시 수행될 코드, 주로 인스턴스 변수의 초기화 코드를 작성
		//}
		//2. 리턴값이 없음(void를 붙이지 않음. 항상 반환값이 없기 때문)
		//3. 모든 클래스는 반드시 생성자를 1개 이상이 있어야함
		
		//기본 생성자
		//매개변수가 없는 생성자 -> 클래스이름(){}
		//생성자가 하나도 없을 때만, 컴파일러가 자동 추가
		
		
		//매개변수가 있는 생성자
		//코드가 간결해짐

	}

}
